; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	instrument11 - instrument
	image2 - mode
	image1 - mode
	infrared3 - mode
	thermograph0 - mode
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star9 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation2 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(supports instrument1 image1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 Star6)
	(supports instrument2 infrared3)
	(supports instrument2 image2)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(supports instrument3 thermograph0)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation3)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation0)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star7)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star6)
	(supports instrument5 image1)
	(supports instrument5 infrared3)
	(supports instrument5 image2)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image1)
	(supports instrument6 infrared3)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star9)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation4)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 Star9)
	(supports instrument9 image1)
	(supports instrument9 thermograph0)
	(supports instrument9 infrared3)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(supports instrument10 image2)
	(supports instrument10 infrared3)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star5)
	(calibration_target instrument10 GroundStation1)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 GroundStation2)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon14)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(pointing satellite2 Star5)
	(pointing satellite4 GroundStation4)
	(have_image Planet10 infrared3)
	(have_image Phenomenon11 thermograph0)
	(have_image Planet12 thermograph0)
	(have_image Planet13 image1)
	(have_image Phenomenon14 image2)
))

)

; plan
1. (turn_to satellite4 groundstation4 phenomenon14)
   deleted: (pointing satellite4 phenomenon14)
   added: (pointing satellite4 groundstation4)
   goals met: 1 of 8
2. (turn_to satellite2 groundstation1 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation1)
   goals met: 1 of 8
3. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 8
4. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 1 of 8
5. (turn_to satellite2 planet10 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet10)
   goals met: 1 of 8
6. (take_image satellite2 planet10 instrument5 infrared3)
   added: (have_image planet10 infrared3)
   goals met: 2 of 8
7. (turn_to satellite2 phenomenon14 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon14)
   goals met: 2 of 8
8. (turn_to satellite1 groundstation1 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 8
9. (take_image satellite2 phenomenon14 instrument5 image2)
   added: (have_image phenomenon14 image2)
   goals met: 4 of 8
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 8
11. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 4 of 8
12. (turn_to satellite0 phenomenon11 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon11)
   goals met: 4 of 8
13. (take_image satellite0 phenomenon11 instrument0 thermograph0)
   added: (have_image phenomenon11 thermograph0)
   goals met: 5 of 8
14. (turn_to satellite0 planet12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet12)
   goals met: 5 of 8
15. (take_image satellite0 planet12 instrument0 thermograph0)
   added: (have_image planet12 thermograph0)
   goals met: 6 of 8
16. (turn_to satellite2 planet13 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet13)
   goals met: 6 of 8
17. (take_image satellite2 planet13 instrument5 image1)
   added: (have_image planet13 image1)
   goals met: 7 of 8
18. (turn_to satellite2 star5 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star5)
   goals met: 8 of 8
